print("." * 50)
print("""
Събуждаш се от ужасен кошмар, в който си сънувал, че се разхождаш в мистична борова гора.
Въпреки това, заради среднощното преживяване си приключенски настроен
и решаваш да се разходиш в близката гора, 
за която си чел какви ли не странни и абсурдни истории в интернет.
""")
start_game = input("Натисни <enter>, ако си готов да започнеш приключението!")

def start_again():
    print("." * 20)
    input("Натисни <enter>, за да се събудиш!")
    print("""
    Събуждаш се и осъзнаваш, че всичко е било един кошмар.
    Въпреки лошият сън, решаваш да се разходиш в близката гора, но с едно наум!
    """)
    input("Натисни стрелка нагоре и <enter>, за да започнете приключението отново!")

print("." * 20)
print("""
След няколко часа път с камили пристигаш до началото 
на вековната борова гора. Намираш се на кръстопът.

1. Наляво виждаш спокойна пътечка, която отвежда до празна полянка.
2. Направо се намира мистичната гора, която е плашещо тиха.
3. Отдясно, в далечината, чуваш звук на вода. Най-вероятно някакъв водопад.
""")

path = input('> ')

if path == "1":
    print("." * 20)
    print("""
    След кратка разходка достигаш зелена полянка, заобиколена от дървета, 
    която е покрита със зелени площи, цветя и билки. 
    Посредата на поляната се намира кошница, която е пълна с храна и вино.
    """)
    print("""
    \n1. Отиди при кошницата и си направи пикник.""")
    print("2. Набери билки и цветя.")

    field = input('> ')

    if field == "1":
        print("." * 20)
        print("""
        Решаваш, че приключенията са за загубеняци
        и избираш да си направиш пикник, вместо да се занимаваш с глупости.
        Виното в кошницата се оказва отровено и умираш за по малко от 5 мин.
        """)
        print("Game Over!")
    elif field == "2":
        print("." * 20)
        print("""
        Набираш си китка от лалета, минзухари и билки и решаваш
        да се прибереш в къщи. Поне се разходи малко, пак е нещо.
        """)
        print("Game Over!")

elif path == "2":
    print("." * 20)
    print("""
    Продължаваш напред в гората. Заграден си от пълна тишина.
    \"Къде са всички птици и насекоми?\" - си казваш ти.
    С всяка измината крачка имаш чувството, че гората става все по-тиха.
    Как е възможно това?
    """)
    input("Натиснете <enter>, за да продължите.")
    print("." * 20)
    print("""
    Загубваш тотална представа за времето. 
    В гората си от по-малко от 30 минути, но имаш чувството, че са минали няколко часа.
    В крайна сметка, достигаш до разклон в пътечката.
    """)
    print("\n1. Можеш да продължиш направо по горската пътека.")
    print("""\n2. Отдясно виждаш пушек от комин и те лъхва миризма на прясно сготвена гозба.
    Чак сега осъзнаваш, че си забравил да си вземеш провизии, и че стомаха ти къркори от глад. """)

    forest = input('> ')

    if forest == "1":
        print("." * 20)
        print("""
        \n\tПродължаваш напред и достигаш нов разклон на пътечката.
        Този път виждаш малка дървена тъбела, която сочи наляво и направо.
        Виждаш символ \"T\" на табелката за наляво.
        На табелката за напред е нарисувано нещо, което прилича на постройка.
        """)
        print("\nНакъде избираш да продължиш?")
        print("1. Продължи напред.")
        print("2. Завий наляво.")

        forest_path = input('> ')
        
        if forest_path == "1":
            print("." * 20)
            print("""
            Навлизаш все по-дълбоко в мистичната гора.
            От гъстите корони на дърветата, слънчевата светлина е минимална.
            Вече си загубил тотална представа за времето. Може би си тук от 2
            или 12 часа, не можеш да прецениш. Какво по-дяволите се случва?
            """)
            print("""
            \n1. Краката ти се подкосяват. Май е добра идея да си поемеш малко въздух преди да продължиш.""")
            print("\n2. Нямаш време за почивки, искаш да разбереш какво има напред!")

            pause = input('> ')

            if pause == "1":
                print("." * 20)
                print("""
                Спираш за няколко минутки да си поемеш въздух.
                Умрял от глад, изваждаш един Сникерс от джоба си.
                \"Не си ти, когато си гладен\" - си казваш. 
                """)
                input("Натисни <enter>, когато си готов да продължиш.")
                print("." * 20)
                print("""
                Продължаваш напред с нови сили 
                и достигаш вход на изоставен храм.
                """)
                print("\n1. Опитваш се да отвориш вратата.")
                print("""
                2. Имаш странното усещане, че някой те наблюдава.
                Интуицията ти подсказва, че май е добра идея да си биеш камшика.
                """)

                entrance = input('> ')

                if entrance == "1":
                    print("." * 20)
                    print("Не можеш да влезнеш, липсва ти ключ за ключалката.")
                elif entrance == "2":
                    print("." * 20)
                    print("""
                    Заради, почивката, която направи,
                    си привлякъл вниманието на странна горска фигура.
                    Биваш оцелен със стрела, сготвен и изяден.
                    """)
                    print("Game Over!")

            elif pause == "2":
                print("." * 20)
                print("""
                Продължаваш напред, 
                достигаш вход на древен изоставен храм.
                """)
                print("\n1. Опитваш се да отвориш вратата.")
                print("\n2. Изведнъж те побиват тръпки. Решаваш да се върнеш по пътеката и да се прибереш.")
                
                entrance = input('> ')
                
                if entrance == "1":
                    print("." * 20)
                    print("Не можеш да влезнеш, липсва ти ключ за ключалката.")
                    print("To be continued!")
                elif entrance == "2":
                    print("." * 20)
                    print("""
                    Тръгваш да бягаш, 
                    но не можеш да мръднеш... вцепенен си.
                    """)
                    print("To be continued!")

        elif forest_path == "2":
            print("." * 20)
            print("""
            След още няколко минути или часа достигаш до тих ручей.
            Това е първият звук, който чуваш от часове насам.
            До него седи мистериозна фигура.
            Тъй като вече си загубил абсолютна представа за време и пространство
            решаваш да го попиташ за насока.
            """)
            input("Натисни <enter>, за да заговорите непознатия човек.")
            print("""
            Преди да успееш да си отвориш устата, той те посреща и те пита
            един прост въпрос. Абониран ли си за канала на PewDiePie?
            """)
            print("1. Да, разбира се!")
            print("2. Не, кой подяволите е това?")

            subscribed = input('> ')

            if subscribed =="1":
                print("." * 20)
                print("""
                Мистериозната фигура се оказва, човек от Индия!
                Той ти прилага Хинду магия и температурата на кръвта ти се покачва
                изключително бързо. Умираш от множествени вътрешни кръвоизливи!
                През това време, той ти взима телефона 
                и те абонира за канала на T-Series!
                """)
                print("Game Over!")
            elif subscribed == "2":
                print("." * 20)
                print("""
                Мистериозната фигура те моли да му дадеш телефона си, 
                за да може да ти обясни къде се намираш. Учудващо как в неговите
                ръце телефонът има обхват, а в твойте не. Оказва, се че е индиец!
                Той отваря YouTube и те абонира за канала на T-Series!
                Не можеш да понесеш болката от този факт и се самоубиваш на място.
                """)
                print("Game Over!")

    elif forest == "2":
        print("." * 20)
        print("""
        Следваш миризмата на вкусна храна и 
        стигаш до малка къщурка потънала в горска растителност.
        """)
        print("""
        1. Решаваш да почукаш на вратата.
        """)
        print("""
        2. Интуицията ти подсказва, 
        че май не е добра да идея да се задържаш тук.
        """)

        door = input("> ")

        if door == "1":
            print("." * 20)
            print("""
            Умрял от глад, отиваш до вратата и преди да успееш да почукаш
            тя сама се отваря! Посреща те стара прегърбена женичка, която
            ти казва, че е много щастлива, когато ѝ идват гости!
            """)
            print("\"Гозбата тамън стана! Ще останеш ли за вечеря?\"")
            print("1. Умираш от глад. Защо пък да не хапнеш набързо преди да продължиш!")
            print("2. Умираш от глад, но въпреки това решаваш, че глада не е важен и имаш по-интересни неща за правене!")

            dinner = input('> ')

            if dinner == "1":
                print("." * 20)
                print("""
                Влизаш в къщурката, която отвътре изглежда няколко пъти по-голяма
                отколкото отвън! В този момент забелязваш, че по стените са
                закачени човешки черепи! Решаваш да си плюеш на петите час по-скоро,
                но в същия момент вратата зад теб внезапно се затваря.
                """)
                input("Натисни <enter>, за да се опиташ да отвориш вратата и да избягаш!")
                print("." * 20)
                print("*Вратата е като закована... Не помръдва!*")
                print("""
                През това време старата женичка вече е сервирала две купи с яхния.
                \"Много съм развълнувана!\" - казва тя 
                \" Не съм имала гости от месеци насам. Тамън се бях притеснила, 
                че ми свършват запасите на месо и ти се появи!\"
                """)
                input("Натисни <enter>, за да продължиш!")
                print("""
                В този момент осъзнаваш, 
                че си вцепенен и не можеш да помръднеш!
                Усещаш как изпадаш в транс. Каква е тази магия?
                """)
                input("Натисни <enter>, за да се опиташ да разбиеш магията.")
                print("""
                \"Моля те, не бъди невъзпитан\" - продължава старицата -
                седни на масата И СИ ИЗЯЖ МАНДЖАТА!!!
                """)
                print("1. Седни на масата и хапни.")
                print("2. В опит на отчаяние си отхапи езика.")

                break_trance = input('> ')

                if break_trance == "1":
                    print("." * 20)
                    print("""
                    Използваш цялата си воля, за да прекъснеш транса, но
                    тялото ти не те слуша. Сякаш е вързано на конци и 
                    някой друг вместо теб решава какво да правиш.
                    Тялото ти сяда на масата, където вече е сервирано.
                    С едно щракване на пръстите женицата отваря устата ти
                    и насочва една пълна лъжица с храна към нея.
                    """)
                    input("Натисни <enter>, за да се противопоставиш!")
                    print("""
                    Неуспешно! 
                    Лъжицата ти влиза в устата и изяждаш порцията.
                    Разбира се, храната е отровена. 
                    Умираш в адски мъки в следващите няколко часа.
                    """)
                    print("Game Over!")
                if break_trance == "2":
                    print("." * 20)
                    print("""
                    С последната капка воля, която ти е останала си отхапваш езика!
                    За съжаление оставаш ням завинаги, НО болката е толкова силна, че
                    успяваш да прекъснеш транса и да се освободиш от магията!
                    """)
                    print("." * 20)
                    print("От устата ти бликва силна струйка кръв, но")
                    input("отдясно на теб виждаш ножица! Натисни <enter>, за да я вземеш!")
                    print("Успешно взимаш ножицата!")
                    print("." * 20)
                    print("""
                    \"МММ, ВКУСНА МЛАДЕЖКА КРЪВВВ\" - изкрещява старицата -
                    която директно се нахвърля към теб!
                    """)
                    input("Натисни <enter>, за да използваш ножицата!")
                    print("""
                    Забиваш с всичка сила ножицата в гърлото на старицата.
                    Тя моментално се стоварва на земята, давейки се в собствената си кръв.
                    Докато си фокусиран върху врата ѝ, забелязваш, че тя носи огърлица 
                    на която виси ключ!
                    """)
                    input("Натисни <enter>, за да вземеш кървавия ключ от врата ѝ!")
                    print("To be continued!")
            elif dinner == "2":
                print("." * 20)
                print("""
                \"Моля те, остани ми поне за малко на гости\" - казва старицата
                \"Не помня, кога за последно съм имала компания.\"
                \"А и, гозбата току що стана! Приготвила съм прясно пилешко варено.\"
                """)
                print("""
                Странно, не виждаш никъде кокошкарник или други животни наоколо,
                но все пак решаваш да влезнеш вътре.
                """)
                input("Натисни <enter>, за да влезнеш в къщата!")
                print("." * 20)
                print("""
                Влизаш в къщурката, която отвътре изглежда няколко пъти по-голяма
                отколкото отвън! В този момент забелязваш, че по стените са
                закачени човешки черепи! Решаваш да си плюеш на петите час по-скоро,
                но в същия момент вратата зад теб внезапно се хлопва.
                """)
                input(
                    "Натисни <enter>, за да се опиташ да отвориш вратата и да избягаш!")
                print("." * 20)
                print("*Вратата е като закована... Не помръдва!*")
                print("""
                През това време старата женичка вече е сервирала две купи с яхния.
                \"Много съм развълнувана!\" - казва тя 
                \" Не съм имала гости от месеци насам. Тамън се бях притеснила, 
                че ми свършват запасите на месо и ти се появи!\"
                """)
                input("Натисни <enter>, за да пробваш пак да отвориш вратата!")
                print("""
                В този момент осъзнаваш, 
                че си вцепенен и не можеш да помръднеш!
                Усещаш как изпадаш в транс. Каква е тази магия?
                """)
                input("Натисни <enter>, за да се опиташ да разбиеш магията!")
                print("." * 20)
                print("""
                \"Моля те, не бъди невъзпитан\" - продължава старицата -
                седни на масата И СИ ИЗЯЖ МАНДЖАТА!!!
                """)
                print("1. Седни на масата и хапни.")
                print("2. В опит на отчаяние си отхапи езика.")

                break_trance = input('> ')

                if break_trance == "1":
                    print("." * 20)
                    print("""
                    Използваш цялата си воля, за да прекъснеш транса, но
                    тялото ти не те слуша. Сякаш е вързано на конци и 
                    някой друг вместо теб решава какво да правиш.
                    Тялото ти сяда на масата, където вече е сервирано.
                    С едно щракване на пръстите женицата отваря устата ти
                    и насочва една пълна лъжица с храна към нея.
                    """)
                    input("Натисни <enter>, за да се противопоставиш!")
                    print("""
                    Неуспешно! 
                    Лъжицата ти влиза в устата и изяждаш порцията.
                    Разбира се, храната е отровена. 
                    Умираш в адски мъки в следващите няколко часа.
                    """)
                    print("Game Over!")
                if break_trance == "2":
                    print("." * 20)
                    print("""
                    С последната капка воля, която ти е останала си отхапваш езика!
                    За съжаление оставаш ням завинаги, НО болката е толкова силна, че
                    успяваш да прекъснеш транса и да се освободиш от магията!
                    """)
                    print("." * 20)
                    print("От устата ти бликва силна струйка кръв, но")
                    input(
                        "отдясно на теб виждаш ножица! Натисни <enter>, за да я вземеш!")
                    print("Успешно взимаш ножицата!")
                    print("." * 20)
                    print("""
                    \"МММ, ВКУСНА МЛАДЕЖКА КРЪВВВ\" - изкрещява старицата -
                    която директно се нахвърля към теб!
                    """)
                    input("Натисни <enter>, за да използваш ножицата!")
                    print("""
                    Забиваш с всичка сила ножицата в гърлото на старицата.
                    Тя моментално се стоварва на земята, давейки се в собствената си кръв.
                    Докато си фокусиран върху врата ѝ, забелязваш, че тя носи огърлица 
                    на която виси ключ!
                    """)
                    input("Натисни <enter>, за да вземеш кървавия ключ от врата ѝ!")
                    print("To be continued!")


        elif door == "2":
            print("." * 20)
            print("""
            Тамън решаваш да се върнеш по главната пътека, когато
            точно в този миг вратата на къщичката се отваря!
            Посреща те стара прегърбена женичка, която
            ти казва, че е много щастлива, когато ѝ идват гости!
            """)
            print("\"Гозбата тамън стана! Ще останеш ли за вечеря?\"")
            print("1. Умираш от глад. Защо пък да не хапнеш набързо преди да продължиш!")
            print("2. Умираш от глад, но въпреки това решаваш, че глада не е важен и имаш по-интересни неща за правене!")

            dinner = input('> ')

            if dinner == "1":
                print("." * 20)
                print("""
                Влизаш в къщурката, която отвътре изглежда няколко пъти по-голяма
                отколкото отвън! В този момент забелязваш, че по стените са
                закачени човешки черепи! Решаваш да си плюеш на петите час по-скоро,
                но в същия момент вратата зад теб внезапно се хлопва.
                """)
                input("Натисни <enter>, за да се опиташ да отвориш вратата и да избягаш!")
                print("." * 20)
                print("*Вратата е като закована... Не помръдва!*")
                print("""
                През това време старата женичка вече е сервирала две купи с яхния.
                \"Много съм развълнувана!\" - казва тя 
                \"Не съм имала гости от месеци насам. Тамън се бях притеснила, 
                че ми свършват запасите на месо и ти се появи!\"
                """)
                input("Натисни <enter>, за да опиташ пак да отвориш вратата!")
                print("""
                В този момент осъзнаваш, 
                че си вцепенен и не можеш да помръднеш!
                Усещаш как изпадаш в транс. Каква е тази магия?
                """)
                input("Натисни <enter>, за да се опиташ да разбиеш магията.")
                print("""
                \"Моля те, не бъди невъзпитан\" - продължава старицата -
                седни на масата И СИ ИЗЯЖ МАНДЖАТА!!!
                """)
                print("1. Седни на масата и хапни.")
                print("2. В опит на отчаяние си отхапи езика.")

                break_trance = input('> ')

                if break_trance == "1":
                    print("." * 20)
                    print("""
                    Използваш цялата си воля, за да прекъснеш транса, но
                    тялото ти не те слуша. Сякаш е вързано на конци и 
                    някой друг вместо теб решава какво да правиш.
                    Тялото ти сяда на масата, където вече е сервирано.
                    С едно щракване на пръстите женицата отваря устата ти
                    и насочва една пълна лъжица с храна към нея.
                    """)
                    input("Натисни <enter>, за да се противопоставиш!")
                    print("""
                    Неуспешно! 
                    Лъжицата ти влиза в устата и изяждаш порцията.
                    Разбира се, храната е отровена. 
                    Умираш в адски мъки в следващите няколко часа.
                    """)
                    print("Game Over!")
                if break_trance == "2":
                    print("." * 20)
                    print("""
                    С последната капка воля, която ти е останала си отхапваш езика!
                    За съжаление оставаш ням завинаги, НО болката е толкова силна, че
                    успяваш да прекъснеш транса и да се освободиш от магията!
                    """)
                    print("." * 20)
                    print("От устата ти бликва силна струйка кръв, но")
                    input(
                        "отдясно на теб виждаш ножица! Натисни <enter>, за да я вземеш!")
                    print("Успешно взимаш ножицата!")
                    print("." * 20)
                    print("""
                    \"МММ, ВКУСНА МЛАДЕЖКА КРЪВВВ\" - изкрещява старицата -
                    която директно се нахвърля към теб!
                    """)
                    input("Натисни <enter>, за да използваш ножицата!")
                    print("""
                    Забиваш с всичка сила ножицата в гърлото на старицата.
                    Тя моментално се стоварва на земята, давейки се в собствената си кръв.
                    Докато си фокусиран върху врата ѝ, забелязваш, че тя носи огърлица 
                    на която виси ключ!
                    """)
                    input("Натисни <enter>, за да вземеш кървавия ключ от врата ѝ!")
                    print("To be continued!")
            elif dinner == "2":
                print("." * 20)
                print("""
                \"Моля те, остани ми поне за малко на гости\" - казва старицата
                \"Не помня, кога за последно съм имала компания.\"
                \"А и, гозбата току що стана! Приготвила съм прясно пилешко варено.\"
                """)
                print("""
                Странно, не виждаш никъде кокошкарник или други животни наоколо,
                но все пак решаваш да влезнеш вътре.
                """)
                input("Натисни <enter>, за да влезнеш в къщата!")
                print("." * 20)
                print("""
                Влизаш в къщурката, която отвътре изглежда няколко пъти по-голяма
                отколкото отвън! В този момент забелязваш, че по стените са
                закачени човешки черепи! Решаваш да си плюеш на петите час по-скоро,
                но в същия момент вратата зад теб внезапно се хлопва.
                """)
                input("Натисни <enter>, за да се опиташ да отвориш вратата и да избягаш!")
                print("." * 20)
                print("*Вратата е като закована... Не помръдва!*")
                print("""
                През това време старата женичка вече е сервирала две купи с яхния.
                \"Много съм развълнувана!\" - казва тя 
                \" Не съм имала гости от месеци насам. Тамън се бях притеснила, 
                че ми свършват запасите на месо и ти се появи!\"
                """)
                input("Натисни <enter>, за да пробваш пак да отвориш вратата!")
                print("""
                В този момент осъзнаваш, 
                че си вцепенен и не можеш да помръднеш!
                Усещаш как изпадаш в транс. Каква е тази магия?
                """)
                input("Натисни <enter>, за да се опиташ да разбиеш магията!")
                print("." * 20)
                print("""
                \"Моля те, не бъди невъзпитан\" - продължава старицата -
                седни на масата И СИ ИЗЯЖ МАНДЖАТА!!!
                """)
                print("1. Седни на масата и хапни.")
                print("2. В опит на отчаяние си отхапи езика.")

                break_trance = input('> ')

                if break_trance == "1":
                    print("." * 20)
                    print("""
                    Използваш цялата си воля, за да прекъснеш транса, но
                    тялото ти не те слуша. Сякаш е вързано на конци и 
                    някой друг вместо теб решава какво да правиш.
                    Тялото ти сяда на масата, където вече е сервирано.
                    С едно щракване на пръстите женицата отваря устата ти
                    и насочва една пълна лъжица с храна към нея.
                    """)
                    input("Натисни <enter>, за да се противопоставиш!")
                    print("""
                    Неуспешно! 
                    Лъжицата ти влиза в устата и изяждаш порцията.
                    Разбира се, храната е отровена. 
                    Умираш в адски мъки в следващите няколко часа.
                    """)
                    print("Game Over!")
                if break_trance == "2":
                    print("." * 20)
                    print("""
                    С последната капка воля, която ти е останала си отхапваш езика!
                    За съжаление оставаш ням завинаги, НО болката е толкова силна, че
                    успяваш да прекъснеш транса и да се освободиш от магията!
                    """)
                    print("." * 20)
                    print("От устата ти бликва силна струйка кръв, но")
                    input(
                        "отдясно на теб виждаш ножица! Натисни <enter>, за да я вземеш!")
                    print("Успешно взимаш ножицата!")
                    print("." * 20)
                    print("""
                    \"МММ, ВКУСНА МЛАДЕЖКА КРЪВВВ\" - изкрещява старицата -
                    която директно се нахвърля към теб!
                    """)
                    input("Натисни <enter>, за да използваш ножицата!")
                    print("""
                    Забиваш с всичка сила ножицата в гърлото на старицата.
                    Тя моментално се стоварва на земята, давейки се в собствената си кръв.
                    Докато си фокусиран върху врата ѝ, забелязваш, че тя носи огърлица 
                    на която виси ключ!
                    """)
                    input("Натисни <enter>, за да вземеш кървавия ключ от врата ѝ!")
                    print("To be continued!")

if path == "3":
    print("." * 20)
    print("""
    След кратка разходка, достигаш до величествен водопад,
    който те изпълва с неимоверно спокойствие!
    """)
    print("1. Решаваш да останеш до водопада и да медитираш набързо.")
    print("2. Виждаш нещо да блести зад водопада.")

    waterfall = input('> ')

    if waterfall == "1":
        print("." * 20)
        print("""
        Водопада те изпълва с такова спокойствие, че
        не усещаш как си прекарал 7 дни в медитация. 
        Чувстваш се толкова дехидратиран, че си на ръба на силите си!
        Какъв късмет, че до теб има цял водопад, от който да пиеш!
        """)
        input("Натисни <enter>, за да отпиеш от водата!")
        print("." * 20)
        print("Водата се оказва ГМО и умираш веднагически...")
        print("Game Over!")

    elif waterfall == "2":
        print("." * 20)
        print("""
        Минаваш през водопада и се озоваваш пред огромна пещера.
        Оказва се, че това, което е блестяло зад водопада е златна огърлица.
        \"Какъв късмет!\" - си казваш.
        """)
        print("1. Решаваш да се протегнеш и да вземеш златната огърлица.")
        print("2. Не си дошъл за джунджурийки, а за приключения. Навлизаш по-надълбоко в пещерата.")

        behind_waterfall = input('> ')

        if behind_waterfall == "1":
            print("." * 20)
            print("""
            Протягаш се към златната огърлица.
            Оказва, се че това е Медноглава змия, която примамва алчни хора.
            Биваш охапен и умираш в адски мъки през следващите 24 часа.
            """)
            print("Game Over!")

        elif behind_waterfall == "2":
            print("." * 20)
            print("Продължаваш навътре в пещерата, но мрака те обгръща малко по малко.")
            input("Натисни <enter>, за да си извадиш телефона и да включиш фенер.")
            print("." * 20)
            print("""
            Странно, но телефона е без батерия. Сигурен си, че си го заредил сутринта.
            \"Скапани Айфони.\" - си казваш ти.
            За твой късмет, след още няколко крачки,
            отнякъде в далечината започва да се вижда червена и бяла светлина.
            """)
            print("Стигаш до кръстопът:")
            print("1. Продължи наляво към бялата светлина.")
            print("2. Продължи надясно към червената светлина.")

            cave = input('> ')

            if cave == "1":
                print("." * 20)
                print("""
                Продължаваш към бялата светлина. Усещаш едно приятно спокойствие
                с всяка измината крачка. Още няколко крачки и стигаш до голяма галерия.
                """)
                input("Натисни <enter>, за да влезнеш в галерията.")
                print("." * 20)
                print("""
                Влизаш в галерията, където си моментално заслепен от светлината.
                Оказва се, че се намираш в леговище на мечки Гризли.
                Алфа мечката те напада като те разкъсва по-лошо и от Леонардо Дикаприо...
                """)
                print("Game Over!")

            elif cave == "2":
                print("." * 20)
                print("""
                Продължаваш към червената светлина. С всяка измината крачка
                изпитваш все по-голяма тревожност, но вече нямаш избор.
                Още няколко крачки и стигаш до малка, но древна галерия.
                Посредата се намира стар езически алтар.
                """)
                print("1. Любопитството е по-силно от теб. Доближи се до алтара.")
                print("2. Чувството на тревожност е по-силно от теб. Опитай се да избягаш.")

                altar = input('> ')

                if altar == "1":
                    print("." * 20)
                    print("""
                    Доближаваш се до езическия алтар.
                    На него виждаш символ на мъж и жена, които се превръщат в едно.
                    \"Много странно\" - си казваш ти - 
                    \"тая древна нация са били някви джендери\"
                    """)
                    print("Посредата на алтара виждаш плоча, на която е отпечатан символ на ръка.")
                    input("Натисни <enter>, за да си сложиш ръката.")
                    print("." * 20)
                    print("""
                    Слагаш си ръката на алтара. Светлината около теб от червена,
                    започва да блещука и да си променя цвета към синя.
                    Скоростта на промяна става все по-бързо и светлината става все по-ярка.
                    Изведнъж ослепяваш за няколко секунди и осъзнаваш, че нещо
                    странно се случва с теб, чак ти ставаш лошо.
                    След силен шок в тялото и загуба на съзнанието, за неопределено време,
                    се събуждаш и виждаш, че тялото ти е променено!
                    """)
                    input("Натисни <enter>, за да погледнеш в гащите си.")
                    print("." * 20)
                    print("""
                    ШОК и УЖАС!
                    ПРЕВЪРНАЛ СИ СЕ В ДЖЕНДЪР...
                    От мъка и погнуса, решаваш да извадиш ножицата, която
                    носиш в себе си и да се самоубиеш...
                    """)
                    print("Game Over!")

                if altar == "2":
                    print("." * 20)
                    print("""
                    Осъзнаваш, че няма на къде даизбягаш, 
                    което не се нрави на стаята.
                    Тя отваря някакви дупки в стената, които се оказват
                    древен защитен механизъм.
                    """)
                    input("Натисни <enter>, за да потърсиш за ръчка.")
                    print("." * 20)
                    print("*Неуспешно!*")
                    print("Биваш прободен от стотици малки копия.")
                    print("Game Over!")

#play_again = "yes"
#while play_again == "yes" or play_again == "да":
start_again()
   #play_again = input("Do you want to play again?")

